Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/udphs.h
/*
 * Component description for UDPHS
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-04T10:37:14Z */
#ifndef _SAMA5D_UDPHS_COMPONENT_H_
#define _SAMA5D_UDPHS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR UDPHS                                        */
/* ************************************************************************** */

/* -------- UDPHS_DMANXTDSC : (UDPHS Offset: 0x00) (R/W 32) UDPHS DMA Next Descriptor Address Register (channel = 0) -------- */
#define UDPHS_DMANXTDSC_NXT_DSC_ADD_Pos       _UINT32_(0)                                          /* (UDPHS_DMANXTDSC) Next Descriptor Address Position */
#define UDPHS_DMANXTDSC_NXT_DSC_ADD_Msk       (_UINT32_(0xFFFFFFFF) << UDPHS_DMANXTDSC_NXT_DSC_ADD_Pos) /* (UDPHS_DMANXTDSC) Next Descriptor Address Mask */
#define UDPHS_DMANXTDSC_NXT_DSC_ADD(value)    (UDPHS_DMANXTDSC_NXT_DSC_ADD_Msk & (_UINT32_(value) << UDPHS_DMANXTDSC_NXT_DSC_ADD_Pos)) /* Assigment of value for NXT_DSC_ADD in the UDPHS_DMANXTDSC register */
#define UDPHS_DMANXTDSC_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (UDPHS_DMANXTDSC) Register Mask  */


/* -------- UDPHS_DMAADDRESS : (UDPHS Offset: 0x04) (R/W 32) UDPHS DMA Channel Address Register (channel = 0) -------- */
#define UDPHS_DMAADDRESS_BUFF_ADD_Pos         _UINT32_(0)                                          /* (UDPHS_DMAADDRESS) Buffer Address Position */
#define UDPHS_DMAADDRESS_BUFF_ADD_Msk         (_UINT32_(0xFFFFFFFF) << UDPHS_DMAADDRESS_BUFF_ADD_Pos) /* (UDPHS_DMAADDRESS) Buffer Address Mask */
#define UDPHS_DMAADDRESS_BUFF_ADD(value)      (UDPHS_DMAADDRESS_BUFF_ADD_Msk & (_UINT32_(value) << UDPHS_DMAADDRESS_BUFF_ADD_Pos)) /* Assigment of value for BUFF_ADD in the UDPHS_DMAADDRESS register */
#define UDPHS_DMAADDRESS_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (UDPHS_DMAADDRESS) Register Mask  */


/* -------- UDPHS_DMACONTROL : (UDPHS Offset: 0x08) (R/W 32) UDPHS DMA Channel Control Register (channel = 0) -------- */
#define UDPHS_DMACONTROL_CHANN_ENB_Pos        _UINT32_(0)                                          /* (UDPHS_DMACONTROL) (Channel Enable Command) Position */
#define UDPHS_DMACONTROL_CHANN_ENB_Msk        (_UINT32_(0x1) << UDPHS_DMACONTROL_CHANN_ENB_Pos)    /* (UDPHS_DMACONTROL) (Channel Enable Command) Mask */
#define UDPHS_DMACONTROL_CHANN_ENB(value)     (UDPHS_DMACONTROL_CHANN_ENB_Msk & (_UINT32_(value) << UDPHS_DMACONTROL_CHANN_ENB_Pos)) /* Assigment of value for CHANN_ENB in the UDPHS_DMACONTROL register */
#define UDPHS_DMACONTROL_LDNXT_DSC_Pos        _UINT32_(1)                                          /* (UDPHS_DMACONTROL) Load Next Channel Transfer Descriptor Enable (Command) Position */
#define UDPHS_DMACONTROL_LDNXT_DSC_Msk        (_UINT32_(0x1) << UDPHS_DMACONTROL_LDNXT_DSC_Pos)    /* (UDPHS_DMACONTROL) Load Next Channel Transfer Descriptor Enable (Command) Mask */
#define UDPHS_DMACONTROL_LDNXT_DSC(value)     (UDPHS_DMACONTROL_LDNXT_DSC_Msk & (_UINT32_(value) << UDPHS_DMACONTROL_LDNXT_DSC_Pos)) /* Assigment of value for LDNXT_DSC in the UDPHS_DMACONTROL register */
#define UDPHS_DMACONTROL_END_TR_EN_Pos        _UINT32_(2)                                          /* (UDPHS_DMACONTROL) End of Transfer Enable (Control) Position */
#define UDPHS_DMACONTROL_END_TR_EN_Msk        (_UINT32_(0x1) << UDPHS_DMACONTROL_END_TR_EN_Pos)    /* (UDPHS_DMACONTROL) End of Transfer Enable (Control) Mask */
#define UDPHS_DMACONTROL_END_TR_EN(value)     (UDPHS_DMACONTROL_END_TR_EN_Msk & (_UINT32_(value) << UDPHS_DMACONTROL_END_TR_EN_Pos)) /* Assigment of value for END_TR_EN in the UDPHS_DMACONTROL register */
#define UDPHS_DMACONTROL_END_B_EN_Pos         _UINT32_(3)                                          /* (UDPHS_DMACONTROL) End of Buffer Enable (Control) Position */
#define UDPHS_DMACONTROL_END_B_EN_Msk         (_UINT32_(0x1) << UDPHS_DMACONTROL_END_B_EN_Pos)     /* (UDPHS_DMACONTROL) End of Buffer Enable (Control) Mask */
#define UDPHS_DMACONTROL_END_B_EN(value)      (UDPHS_DMACONTROL_END_B_EN_Msk & (_UINT32_(value) << UDPHS_DMACONTROL_END_B_EN_Pos)) /* Assigment of value for END_B_EN in the UDPHS_DMACONTROL register */
#define UDPHS_DMACONTROL_END_TR_IT_Pos        _UINT32_(4)                                          /* (UDPHS_DMACONTROL) End of Transfer Interrupt Enable Position */
#define UDPHS_DMACONTROL_END_TR_IT_Msk        (_UINT32_(0x1) << UDPHS_DMACONTROL_END_TR_IT_Pos)    /* (UDPHS_DMACONTROL) End of Transfer Interrupt Enable Mask */
#define UDPHS_DMACONTROL_END_TR_IT(value)     (UDPHS_DMACONTROL_END_TR_IT_Msk & (_UINT32_(value) << UDPHS_DMACONTROL_END_TR_IT_Pos)) /* Assigment of value for END_TR_IT in the UDPHS_DMACONTROL register */
#define UDPHS_DMACONTROL_END_BUFFIT_Pos       _UINT32_(5)                                          /* (UDPHS_DMACONTROL) End of Buffer Interrupt Enable Position */
#define UDPHS_DMACONTROL_END_BUFFIT_Msk       (_UINT32_(0x1) << UDPHS_DMACONTROL_END_BUFFIT_Pos)   /* (UDPHS_DMACONTROL) End of Buffer Interrupt Enable Mask */
#define UDPHS_DMACONTROL_END_BUFFIT(value)    (UDPHS_DMACONTROL_END_BUFFIT_Msk & (_UINT32_(value) << UDPHS_DMACONTROL_END_BUFFIT_Pos)) /* Assigment of value for END_BUFFIT in the UDPHS_DMACONTROL register */
#define UDPHS_DMACONTROL_DESC_LD_IT_Pos       _UINT32_(6)                                          /* (UDPHS_DMACONTROL) Descriptor Loaded Interrupt Enable Position */
#define UDPHS_DMACONTROL_DESC_LD_IT_Msk       (_UINT32_(0x1) << UDPHS_DMACONTROL_DESC_LD_IT_Pos)   /* (UDPHS_DMACONTROL) Descriptor Loaded Interrupt Enable Mask */
#define UDPHS_DMACONTROL_DESC_LD_IT(value)    (UDPHS_DMACONTROL_DESC_LD_IT_Msk & (_UINT32_(value) << UDPHS_DMACONTROL_DESC_LD_IT_Pos)) /* Assigment of value for DESC_LD_IT in the UDPHS_DMACONTROL register */
#define UDPHS_DMACONTROL_BURST_LCK_Pos        _UINT32_(7)                                          /* (UDPHS_DMACONTROL) Burst Lock Enable Position */
#define UDPHS_DMACONTROL_BURST_LCK_Msk        (_UINT32_(0x1) << UDPHS_DMACONTROL_BURST_LCK_Pos)    /* (UDPHS_DMACONTROL) Burst Lock Enable Mask */
#define UDPHS_DMACONTROL_BURST_LCK(value)     (UDPHS_DMACONTROL_BURST_LCK_Msk & (_UINT32_(value) << UDPHS_DMACONTROL_BURST_LCK_Pos)) /* Assigment of value for BURST_LCK in the UDPHS_DMACONTROL register */
#define UDPHS_DMACONTROL_BUFF_LENGTH_Pos      _UINT32_(16)                                         /* (UDPHS_DMACONTROL) Buffer Byte Length (Write-only) Position */
#define UDPHS_DMACONTROL_BUFF_LENGTH_Msk      (_UINT32_(0xFFFF) << UDPHS_DMACONTROL_BUFF_LENGTH_Pos) /* (UDPHS_DMACONTROL) Buffer Byte Length (Write-only) Mask */
#define UDPHS_DMACONTROL_BUFF_LENGTH(value)   (UDPHS_DMACONTROL_BUFF_LENGTH_Msk & (_UINT32_(value) << UDPHS_DMACONTROL_BUFF_LENGTH_Pos)) /* Assigment of value for BUFF_LENGTH in the UDPHS_DMACONTROL register */
#define UDPHS_DMACONTROL_Msk                  _UINT32_(0xFFFF00FF)                                 /* (UDPHS_DMACONTROL) Register Mask  */


/* -------- UDPHS_DMASTATUS : (UDPHS Offset: 0x0C) (R/W 32) UDPHS DMA Channel Status Register (channel = 0) -------- */
#define UDPHS_DMASTATUS_CHANN_ENB_Pos         _UINT32_(0)                                          /* (UDPHS_DMASTATUS) Channel Enable Status Position */
#define UDPHS_DMASTATUS_CHANN_ENB_Msk         (_UINT32_(0x1) << UDPHS_DMASTATUS_CHANN_ENB_Pos)     /* (UDPHS_DMASTATUS) Channel Enable Status Mask */
#define UDPHS_DMASTATUS_CHANN_ENB(value)      (UDPHS_DMASTATUS_CHANN_ENB_Msk & (_UINT32_(value) << UDPHS_DMASTATUS_CHANN_ENB_Pos)) /* Assigment of value for CHANN_ENB in the UDPHS_DMASTATUS register */
#define UDPHS_DMASTATUS_CHANN_ACT_Pos         _UINT32_(1)                                          /* (UDPHS_DMASTATUS) Channel Active Status Position */
#define UDPHS_DMASTATUS_CHANN_ACT_Msk         (_UINT32_(0x1) << UDPHS_DMASTATUS_CHANN_ACT_Pos)     /* (UDPHS_DMASTATUS) Channel Active Status Mask */
#define UDPHS_DMASTATUS_CHANN_ACT(value)      (UDPHS_DMASTATUS_CHANN_ACT_Msk & (_UINT32_(value) << UDPHS_DMASTATUS_CHANN_ACT_Pos)) /* Assigment of value for CHANN_ACT in the UDPHS_DMASTATUS register */
#define UDPHS_DMASTATUS_END_TR_ST_Pos         _UINT32_(4)                                          /* (UDPHS_DMASTATUS) End of Channel Transfer Status Position */
#define UDPHS_DMASTATUS_END_TR_ST_Msk         (_UINT32_(0x1) << UDPHS_DMASTATUS_END_TR_ST_Pos)     /* (UDPHS_DMASTATUS) End of Channel Transfer Status Mask */
#define UDPHS_DMASTATUS_END_TR_ST(value)      (UDPHS_DMASTATUS_END_TR_ST_Msk & (_UINT32_(value) << UDPHS_DMASTATUS_END_TR_ST_Pos)) /* Assigment of value for END_TR_ST in the UDPHS_DMASTATUS register */
#define UDPHS_DMASTATUS_END_BF_ST_Pos         _UINT32_(5)                                          /* (UDPHS_DMASTATUS) End of Channel Buffer Status Position */
#define UDPHS_DMASTATUS_END_BF_ST_Msk         (_UINT32_(0x1) << UDPHS_DMASTATUS_END_BF_ST_Pos)     /* (UDPHS_DMASTATUS) End of Channel Buffer Status Mask */
#define UDPHS_DMASTATUS_END_BF_ST(value)      (UDPHS_DMASTATUS_END_BF_ST_Msk & (_UINT32_(value) << UDPHS_DMASTATUS_END_BF_ST_Pos)) /* Assigment of value for END_BF_ST in the UDPHS_DMASTATUS register */
#define UDPHS_DMASTATUS_DESC_LDST_Pos         _UINT32_(6)                                          /* (UDPHS_DMASTATUS) Descriptor Loaded Status Position */
#define UDPHS_DMASTATUS_DESC_LDST_Msk         (_UINT32_(0x1) << UDPHS_DMASTATUS_DESC_LDST_Pos)     /* (UDPHS_DMASTATUS) Descriptor Loaded Status Mask */
#define UDPHS_DMASTATUS_DESC_LDST(value)      (UDPHS_DMASTATUS_DESC_LDST_Msk & (_UINT32_(value) << UDPHS_DMASTATUS_DESC_LDST_Pos)) /* Assigment of value for DESC_LDST in the UDPHS_DMASTATUS register */
#define UDPHS_DMASTATUS_BUFF_COUNT_Pos        _UINT32_(16)                                         /* (UDPHS_DMASTATUS) Buffer Byte Count Position */
#define UDPHS_DMASTATUS_BUFF_COUNT_Msk        (_UINT32_(0xFFFF) << UDPHS_DMASTATUS_BUFF_COUNT_Pos) /* (UDPHS_DMASTATUS) Buffer Byte Count Mask */
#define UDPHS_DMASTATUS_BUFF_COUNT(value)     (UDPHS_DMASTATUS_BUFF_COUNT_Msk & (_UINT32_(value) << UDPHS_DMASTATUS_BUFF_COUNT_Pos)) /* Assigment of value for BUFF_COUNT in the UDPHS_DMASTATUS register */
#define UDPHS_DMASTATUS_Msk                   _UINT32_(0xFFFF0073)                                 /* (UDPHS_DMASTATUS) Register Mask  */


/* -------- UDPHS_EPTCFG : (UDPHS Offset: 0x00) (R/W 32) UDPHS Endpoint Configuration Register (endpoint = 0) -------- */
#define UDPHS_EPTCFG_EPT_SIZE_Pos             _UINT32_(0)                                          /* (UDPHS_EPTCFG) Endpoint Size (cleared upon USB reset) Position */
#define UDPHS_EPTCFG_EPT_SIZE_Msk             (_UINT32_(0x7) << UDPHS_EPTCFG_EPT_SIZE_Pos)         /* (UDPHS_EPTCFG) Endpoint Size (cleared upon USB reset) Mask */
#define UDPHS_EPTCFG_EPT_SIZE(value)          (UDPHS_EPTCFG_EPT_SIZE_Msk & (_UINT32_(value) << UDPHS_EPTCFG_EPT_SIZE_Pos)) /* Assigment of value for EPT_SIZE in the UDPHS_EPTCFG register */
#define   UDPHS_EPTCFG_EPT_SIZE_8_Val         _UINT32_(0x0)                                        /* (UDPHS_EPTCFG) 8 bytes  */
#define   UDPHS_EPTCFG_EPT_SIZE_16_Val        _UINT32_(0x1)                                        /* (UDPHS_EPTCFG) 16 bytes  */
#define   UDPHS_EPTCFG_EPT_SIZE_32_Val        _UINT32_(0x2)                                        /* (UDPHS_EPTCFG) 32 bytes  */
#define   UDPHS_EPTCFG_EPT_SIZE_64_Val        _UINT32_(0x3)                                        /* (UDPHS_EPTCFG) 64 bytes  */
#define   UDPHS_EPTCFG_EPT_SIZE_128_Val       _UINT32_(0x4)                                        /* (UDPHS_EPTCFG) 128 bytes  */
#define   UDPHS_EPTCFG_EPT_SIZE_256_Val       _UINT32_(0x5)                                        /* (UDPHS_EPTCFG) 256 bytes  */
#define   UDPHS_EPTCFG_EPT_SIZE_512_Val       _UINT32_(0x6)                                        /* (UDPHS_EPTCFG) 512 bytes  */
#define   UDPHS_EPTCFG_EPT_SIZE_1024_Val      _UINT32_(0x7)                                        /* (UDPHS_EPTCFG) 1024 bytes  */
#define UDPHS_EPTCFG_EPT_SIZE_8               (UDPHS_EPTCFG_EPT_SIZE_8_Val << UDPHS_EPTCFG_EPT_SIZE_Pos) /* (UDPHS_EPTCFG) 8 bytes Position  */
#define UDPHS_EPTCFG_EPT_SIZE_16              (UDPHS_EPTCFG_EPT_SIZE_16_Val << UDPHS_EPTCFG_EPT_SIZE_Pos) /* (UDPHS_EPTCFG) 16 bytes Position  */
#define UDPHS_EPTCFG_EPT_SIZE_32              (UDPHS_EPTCFG_EPT_SIZE_32_Val << UDPHS_EPTCFG_EPT_SIZE_Pos) /* (UDPHS_EPTCFG) 32 bytes Position  */
#define UDPHS_EPTCFG_EPT_SIZE_64              (UDPHS_EPTCFG_EPT_SIZE_64_Val << UDPHS_EPTCFG_EPT_SIZE_Pos) /* (UDPHS_EPTCFG) 64 bytes Position  */
#define UDPHS_EPTCFG_EPT_SIZE_128             (UDPHS_EPTCFG_EPT_SIZE_128_Val << UDPHS_EPTCFG_EPT_SIZE_Pos) /* (UDPHS_EPTCFG) 128 bytes Position  */
#define UDPHS_EPTCFG_EPT_SIZE_256             (UDPHS_EPTCFG_EPT_SIZE_256_Val << UDPHS_EPTCFG_EPT_SIZE_Pos) /* (UDPHS_EPTCFG) 256 bytes Position  */
#define UDPHS_EPTCFG_EPT_SIZE_512             (UDPHS_EPTCFG_EPT_SIZE_512_Val << UDPHS_EPTCFG_EPT_SIZE_Pos) /* (UDPHS_EPTCFG) 512 bytes Position  */
#define UDPHS_EPTCFG_EPT_SIZE_1024            (UDPHS_EPTCFG_EPT_SIZE_1024_Val << UDPHS_EPTCFG_EPT_SIZE_Pos) /* (UDPHS_EPTCFG) 1024 bytes Position  */
#define UDPHS_EPTCFG_EPT_DIR_Pos              _UINT32_(3)                                          /* (UDPHS_EPTCFG) Endpoint Direction (cleared upon USB reset) Position */
#define UDPHS_EPTCFG_EPT_DIR_Msk              (_UINT32_(0x1) << UDPHS_EPTCFG_EPT_DIR_Pos)          /* (UDPHS_EPTCFG) Endpoint Direction (cleared upon USB reset) Mask */
#define UDPHS_EPTCFG_EPT_DIR(value)           (UDPHS_EPTCFG_EPT_DIR_Msk & (_UINT32_(value) << UDPHS_EPTCFG_EPT_DIR_Pos)) /* Assigment of value for EPT_DIR in the UDPHS_EPTCFG register */
#define UDPHS_EPTCFG_EPT_TYPE_Pos             _UINT32_(4)                                          /* (UDPHS_EPTCFG) Endpoint Type (cleared upon USB reset) Position */
#define UDPHS_EPTCFG_EPT_TYPE_Msk             (_UINT32_(0x3) << UDPHS_EPTCFG_EPT_TYPE_Pos)         /* (UDPHS_EPTCFG) Endpoint Type (cleared upon USB reset) Mask */
#define UDPHS_EPTCFG_EPT_TYPE(value)          (UDPHS_EPTCFG_EPT_TYPE_Msk & (_UINT32_(value) << UDPHS_EPTCFG_EPT_TYPE_Pos)) /* Assigment of value for EPT_TYPE in the UDPHS_EPTCFG register */
#define   UDPHS_EPTCFG_EPT_TYPE_CTRL8_Val     _UINT32_(0x0)                                        /* (UDPHS_EPTCFG) Control endpoint  */
#define   UDPHS_EPTCFG_EPT_TYPE_ISO_Val       _UINT32_(0x1)                                        /* (UDPHS_EPTCFG) Isochronous endpoint  */
#define   UDPHS_EPTCFG_EPT_TYPE_BULK_Val      _UINT32_(0x2)                                        /* (UDPHS_EPTCFG) Bulk endpoint  */
#define   UDPHS_EPTCFG_EPT_TYPE_INT_Val       _UINT32_(0x3)                                        /* (UDPHS_EPTCFG) Interrupt endpoint  */
#define UDPHS_EPTCFG_EPT_TYPE_CTRL8           (UDPHS_EPTCFG_EPT_TYPE_CTRL8_Val << UDPHS_EPTCFG_EPT_TYPE_Pos) /* (UDPHS_EPTCFG) Control endpoint Position  */
#define UDPHS_EPTCFG_EPT_TYPE_ISO             (UDPHS_EPTCFG_EPT_TYPE_ISO_Val << UDPHS_EPTCFG_EPT_TYPE_Pos) /* (UDPHS_EPTCFG) Isochronous endpoint Position  */
#define UDPHS_EPTCFG_EPT_TYPE_BULK            (UDPHS_EPTCFG_EPT_TYPE_BULK_Val << UDPHS_EPTCFG_EPT_TYPE_Pos) /* (UDPHS_EPTCFG) Bulk endpoint Position  */
#define UDPHS_EPTCFG_EPT_TYPE_INT             (UDPHS_EPTCFG_EPT_TYPE_INT_Val << UDPHS_EPTCFG_EPT_TYPE_Pos) /* (UDPHS_EPTCFG) Interrupt endpoint Position  */
#define UDPHS_EPTCFG_BK_NUMBER_Pos            _UINT32_(6)                                          /* (UDPHS_EPTCFG) Number of Banks (cleared upon USB reset) Position */
#define UDPHS_EPTCFG_BK_NUMBER_Msk            (_UINT32_(0x3) << UDPHS_EPTCFG_BK_NUMBER_Pos)        /* (UDPHS_EPTCFG) Number of Banks (cleared upon USB reset) Mask */
#define UDPHS_EPTCFG_BK_NUMBER(value)         (UDPHS_EPTCFG_BK_NUMBER_Msk & (_UINT32_(value) << UDPHS_EPTCFG_BK_NUMBER_Pos)) /* Assigment of value for BK_NUMBER in the UDPHS_EPTCFG register */
#define   UDPHS_EPTCFG_BK_NUMBER_0_Val        _UINT32_(0x0)                                        /* (UDPHS_EPTCFG) Zero bank, the endpoint is not mapped in memory  */
#define   UDPHS_EPTCFG_BK_NUMBER_1_Val        _UINT32_(0x1)                                        /* (UDPHS_EPTCFG) One bank (bank 0)  */
#define   UDPHS_EPTCFG_BK_NUMBER_2_Val        _UINT32_(0x2)                                        /* (UDPHS_EPTCFG) Double bank (Ping-Pong: bank0/bank1)  */
#define   UDPHS_EPTCFG_BK_NUMBER_3_Val        _UINT32_(0x3)                                        /* (UDPHS_EPTCFG) Triple bank (bank0/bank1/bank2)  */
#define UDPHS_EPTCFG_BK_NUMBER_0              (UDPHS_EPTCFG_BK_NUMBER_0_Val << UDPHS_EPTCFG_BK_NUMBER_Pos) /* (UDPHS_EPTCFG) Zero bank, the endpoint is not mapped in memory Position  */
#define UDPHS_EPTCFG_BK_NUMBER_1              (UDPHS_EPTCFG_BK_NUMBER_1_Val << UDPHS_EPTCFG_BK_NUMBER_Pos) /* (UDPHS_EPTCFG) One bank (bank 0) Position  */
#define UDPHS_EPTCFG_BK_NUMBER_2              (UDPHS_EPTCFG_BK_NUMBER_2_Val << UDPHS_EPTCFG_BK_NUMBER_Pos) /* (UDPHS_EPTCFG) Double bank (Ping-Pong: bank0/bank1) Position  */
#define UDPHS_EPTCFG_BK_NUMBER_3              (UDPHS_EPTCFG_BK_NUMBER_3_Val << UDPHS_EPTCFG_BK_NUMBER_Pos) /* (UDPHS_EPTCFG) Triple bank (bank0/bank1/bank2) Position  */
#define UDPHS_EPTCFG_NB_TRANS_Pos             _UINT32_(8)                                          /* (UDPHS_EPTCFG) Number Of Transaction per Microframe (cleared upon USB reset) Position */
#define UDPHS_EPTCFG_NB_TRANS_Msk             (_UINT32_(0x3) << UDPHS_EPTCFG_NB_TRANS_Pos)         /* (UDPHS_EPTCFG) Number Of Transaction per Microframe (cleared upon USB reset) Mask */
#define UDPHS_EPTCFG_NB_TRANS(value)          (UDPHS_EPTCFG_NB_TRANS_Msk & (_UINT32_(value) << UDPHS_EPTCFG_NB_TRANS_Pos)) /* Assigment of value for NB_TRANS in the UDPHS_EPTCFG register */
#define UDPHS_EPTCFG_EPT_MAPD_Pos             _UINT32_(31)                                         /* (UDPHS_EPTCFG) Endpoint Mapped (cleared upon USB reset) Position */
#define UDPHS_EPTCFG_EPT_MAPD_Msk             (_UINT32_(0x1) << UDPHS_EPTCFG_EPT_MAPD_Pos)         /* (UDPHS_EPTCFG) Endpoint Mapped (cleared upon USB reset) Mask */
#define UDPHS_EPTCFG_EPT_MAPD(value)          (UDPHS_EPTCFG_EPT_MAPD_Msk & (_UINT32_(value) << UDPHS_EPTCFG_EPT_MAPD_Pos)) /* Assigment of value for EPT_MAPD in the UDPHS_EPTCFG register */
#define UDPHS_EPTCFG_Msk                      _UINT32_(0x800003FF)                                 /* (UDPHS_EPTCFG) Register Mask  */


