Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/udphs.h
/* ISOENDPT mode */
#define UDPHS_EPTCTLDIS_ISOENDPT_EPT_DISABL_Pos _UINT32_(0)                                          /* (UDPHS_EPTCTLDIS) Endpoint Disable Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_EPT_DISABL_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_EPT_DISABL_Pos) /* (UDPHS_EPTCTLDIS) Endpoint Disable Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_EPT_DISABL(value) (UDPHS_EPTCTLDIS_ISOENDPT_EPT_DISABL_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_EPT_DISABL_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_AUTO_VALID_Pos _UINT32_(1)                                          /* (UDPHS_EPTCTLDIS) Packet Auto-Valid Disable Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_AUTO_VALID_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_AUTO_VALID_Pos) /* (UDPHS_EPTCTLDIS) Packet Auto-Valid Disable Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_AUTO_VALID(value) (UDPHS_EPTCTLDIS_ISOENDPT_AUTO_VALID_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_AUTO_VALID_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_INTDIS_DMA_Pos _UINT32_(3)                                          /* (UDPHS_EPTCTLDIS) Interrupts Disable DMA Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_INTDIS_DMA_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_INTDIS_DMA_Pos) /* (UDPHS_EPTCTLDIS) Interrupts Disable DMA Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_INTDIS_DMA(value) (UDPHS_EPTCTLDIS_ISOENDPT_INTDIS_DMA_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_INTDIS_DMA_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_DATAX_RX_Pos _UINT32_(6)                                          /* (UDPHS_EPTCTLDIS) DATAx Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints) Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_DATAX_RX_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_DATAX_RX_Pos) /* (UDPHS_EPTCTLDIS) DATAx Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints) Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_DATAX_RX(value) (UDPHS_EPTCTLDIS_ISOENDPT_DATAX_RX_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_DATAX_RX_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_MDATA_RX_Pos _UINT32_(7)                                          /* (UDPHS_EPTCTLDIS) MDATA Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints) Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_MDATA_RX_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_MDATA_RX_Pos) /* (UDPHS_EPTCTLDIS) MDATA Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints) Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_MDATA_RX(value) (UDPHS_EPTCTLDIS_ISOENDPT_MDATA_RX_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_MDATA_RX_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_OVFLW_Pos _UINT32_(8)                                          /* (UDPHS_EPTCTLDIS) Overflow Error Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_OVFLW_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_ERR_OVFLW_Pos) /* (UDPHS_EPTCTLDIS) Overflow Error Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_OVFLW(value) (UDPHS_EPTCTLDIS_ISOENDPT_ERR_OVFLW_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_ERR_OVFLW_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_RXRDY_TXKL_Pos _UINT32_(9)                                          /* (UDPHS_EPTCTLDIS) Received OUT Data Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_RXRDY_TXKL_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_RXRDY_TXKL_Pos) /* (UDPHS_EPTCTLDIS) Received OUT Data Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_RXRDY_TXKL(value) (UDPHS_EPTCTLDIS_ISOENDPT_RXRDY_TXKL_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_RXRDY_TXKL_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_TX_COMPLT_Pos _UINT32_(10)                                         /* (UDPHS_EPTCTLDIS) Transmitted IN Data Complete Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_TX_COMPLT_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_TX_COMPLT_Pos) /* (UDPHS_EPTCTLDIS) Transmitted IN Data Complete Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_TX_COMPLT(value) (UDPHS_EPTCTLDIS_ISOENDPT_TX_COMPLT_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_TX_COMPLT_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_TXRDY_TRER_Pos _UINT32_(11)                                         /* (UDPHS_EPTCTLDIS) TX Packet Ready/Transaction Error Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_TXRDY_TRER_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_TXRDY_TRER_Pos) /* (UDPHS_EPTCTLDIS) TX Packet Ready/Transaction Error Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_TXRDY_TRER(value) (UDPHS_EPTCTLDIS_ISOENDPT_TXRDY_TRER_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_TXRDY_TRER_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_FL_ISO_Pos _UINT32_(12)                                         /* (UDPHS_EPTCTLDIS) Error Flow Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_FL_ISO_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_ERR_FL_ISO_Pos) /* (UDPHS_EPTCTLDIS) Error Flow Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_FL_ISO(value) (UDPHS_EPTCTLDIS_ISOENDPT_ERR_FL_ISO_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_ERR_FL_ISO_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_CRC_NTR_Pos _UINT32_(13)                                         /* (UDPHS_EPTCTLDIS) ISO CRC Error/Number of Transaction Error Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_CRC_NTR_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_ERR_CRC_NTR_Pos) /* (UDPHS_EPTCTLDIS) ISO CRC Error/Number of Transaction Error Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_CRC_NTR(value) (UDPHS_EPTCTLDIS_ISOENDPT_ERR_CRC_NTR_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_ERR_CRC_NTR_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_FLUSH_Pos _UINT32_(14)                                         /* (UDPHS_EPTCTLDIS) bank flush error Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_FLUSH_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_ERR_FLUSH_Pos) /* (UDPHS_EPTCTLDIS) bank flush error Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_ERR_FLUSH(value) (UDPHS_EPTCTLDIS_ISOENDPT_ERR_FLUSH_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_ERR_FLUSH_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_BUSY_BANK_Pos _UINT32_(18)                                         /* (UDPHS_EPTCTLDIS) Busy Bank Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_BUSY_BANK_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_BUSY_BANK_Pos) /* (UDPHS_EPTCTLDIS) Busy Bank Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_BUSY_BANK(value) (UDPHS_EPTCTLDIS_ISOENDPT_BUSY_BANK_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_BUSY_BANK_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_SHRT_PCKT_Pos _UINT32_(31)                                         /* (UDPHS_EPTCTLDIS) Short Packet Interrupt Disable Position */
#define UDPHS_EPTCTLDIS_ISOENDPT_SHRT_PCKT_Msk (_UINT32_(0x1) << UDPHS_EPTCTLDIS_ISOENDPT_SHRT_PCKT_Pos) /* (UDPHS_EPTCTLDIS) Short Packet Interrupt Disable Mask */
#define UDPHS_EPTCTLDIS_ISOENDPT_SHRT_PCKT(value) (UDPHS_EPTCTLDIS_ISOENDPT_SHRT_PCKT_Msk & (_UINT32_(value) << UDPHS_EPTCTLDIS_ISOENDPT_SHRT_PCKT_Pos))
#define UDPHS_EPTCTLDIS_ISOENDPT_Msk          _UINT32_(0x80047FCB)                                  /* (UDPHS_EPTCTLDIS_ISOENDPT) Register Mask  */


/* -------- UDPHS_EPTCTL : (UDPHS Offset: 0x0C) ( R/ 32) UDPHS Endpoint Control Register (endpoint = 0) -------- */
#define UDPHS_EPTCTL_EPT_ENABL_Pos            _UINT32_(0)                                          /* (UDPHS_EPTCTL) Endpoint Enable (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_EPT_ENABL_Msk            (_UINT32_(0x1) << UDPHS_EPTCTL_EPT_ENABL_Pos)        /* (UDPHS_EPTCTL) Endpoint Enable (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_EPT_ENABL(value)         (UDPHS_EPTCTL_EPT_ENABL_Msk & (_UINT32_(value) << UDPHS_EPTCTL_EPT_ENABL_Pos)) /* Assigment of value for EPT_ENABL in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_AUTO_VALID_Pos           _UINT32_(1)                                          /* (UDPHS_EPTCTL) Packet Auto-Valid Enabled (Not for CONTROL Endpoints) (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_AUTO_VALID_Msk           (_UINT32_(0x1) << UDPHS_EPTCTL_AUTO_VALID_Pos)       /* (UDPHS_EPTCTL) Packet Auto-Valid Enabled (Not for CONTROL Endpoints) (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_AUTO_VALID(value)        (UDPHS_EPTCTL_AUTO_VALID_Msk & (_UINT32_(value) << UDPHS_EPTCTL_AUTO_VALID_Pos)) /* Assigment of value for AUTO_VALID in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_INTDIS_DMA_Pos           _UINT32_(3)                                          /* (UDPHS_EPTCTL) Interrupt Disables DMA (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_INTDIS_DMA_Msk           (_UINT32_(0x1) << UDPHS_EPTCTL_INTDIS_DMA_Pos)       /* (UDPHS_EPTCTL) Interrupt Disables DMA (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_INTDIS_DMA(value)        (UDPHS_EPTCTL_INTDIS_DMA_Msk & (_UINT32_(value) << UDPHS_EPTCTL_INTDIS_DMA_Pos)) /* Assigment of value for INTDIS_DMA in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_NYET_DIS_Pos             _UINT32_(4)                                          /* (UDPHS_EPTCTL) NYET Disable (Only for High Speed Bulk OUT Endpoints) (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_NYET_DIS_Msk             (_UINT32_(0x1) << UDPHS_EPTCTL_NYET_DIS_Pos)         /* (UDPHS_EPTCTL) NYET Disable (Only for High Speed Bulk OUT Endpoints) (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_NYET_DIS(value)          (UDPHS_EPTCTL_NYET_DIS_Msk & (_UINT32_(value) << UDPHS_EPTCTL_NYET_DIS_Pos)) /* Assigment of value for NYET_DIS in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_ERR_OVFLW_Pos            _UINT32_(8)                                          /* (UDPHS_EPTCTL) Overflow Error Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_ERR_OVFLW_Msk            (_UINT32_(0x1) << UDPHS_EPTCTL_ERR_OVFLW_Pos)        /* (UDPHS_EPTCTL) Overflow Error Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_ERR_OVFLW(value)         (UDPHS_EPTCTL_ERR_OVFLW_Msk & (_UINT32_(value) << UDPHS_EPTCTL_ERR_OVFLW_Pos)) /* Assigment of value for ERR_OVFLW in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_RXRDY_TXKL_Pos           _UINT32_(9)                                          /* (UDPHS_EPTCTL) Received OUT Data Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_RXRDY_TXKL_Msk           (_UINT32_(0x1) << UDPHS_EPTCTL_RXRDY_TXKL_Pos)       /* (UDPHS_EPTCTL) Received OUT Data Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_RXRDY_TXKL(value)        (UDPHS_EPTCTL_RXRDY_TXKL_Msk & (_UINT32_(value) << UDPHS_EPTCTL_RXRDY_TXKL_Pos)) /* Assigment of value for RXRDY_TXKL in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_TX_COMPLT_Pos            _UINT32_(10)                                         /* (UDPHS_EPTCTL) Transmitted IN Data Complete Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_TX_COMPLT_Msk            (_UINT32_(0x1) << UDPHS_EPTCTL_TX_COMPLT_Pos)        /* (UDPHS_EPTCTL) Transmitted IN Data Complete Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_TX_COMPLT(value)         (UDPHS_EPTCTL_TX_COMPLT_Msk & (_UINT32_(value) << UDPHS_EPTCTL_TX_COMPLT_Pos)) /* Assigment of value for TX_COMPLT in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_TXRDY_Pos                _UINT32_(11)                                         /* (UDPHS_EPTCTL) TX Packet Ready Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_TXRDY_Msk                (_UINT32_(0x1) << UDPHS_EPTCTL_TXRDY_Pos)            /* (UDPHS_EPTCTL) TX Packet Ready Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_TXRDY(value)             (UDPHS_EPTCTL_TXRDY_Msk & (_UINT32_(value) << UDPHS_EPTCTL_TXRDY_Pos)) /* Assigment of value for TXRDY in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_RX_SETUP_Pos             _UINT32_(12)                                         /* (UDPHS_EPTCTL) Received SETUP Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_RX_SETUP_Msk             (_UINT32_(0x1) << UDPHS_EPTCTL_RX_SETUP_Pos)         /* (UDPHS_EPTCTL) Received SETUP Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_RX_SETUP(value)          (UDPHS_EPTCTL_RX_SETUP_Msk & (_UINT32_(value) << UDPHS_EPTCTL_RX_SETUP_Pos)) /* Assigment of value for RX_SETUP in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_STALL_SNT_Pos            _UINT32_(13)                                         /* (UDPHS_EPTCTL) Stall Sent Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_STALL_SNT_Msk            (_UINT32_(0x1) << UDPHS_EPTCTL_STALL_SNT_Pos)        /* (UDPHS_EPTCTL) Stall Sent Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_STALL_SNT(value)         (UDPHS_EPTCTL_STALL_SNT_Msk & (_UINT32_(value) << UDPHS_EPTCTL_STALL_SNT_Pos)) /* Assigment of value for STALL_SNT in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_NAK_IN_Pos               _UINT32_(14)                                         /* (UDPHS_EPTCTL) NAKIN Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_NAK_IN_Msk               (_UINT32_(0x1) << UDPHS_EPTCTL_NAK_IN_Pos)           /* (UDPHS_EPTCTL) NAKIN Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_NAK_IN(value)            (UDPHS_EPTCTL_NAK_IN_Msk & (_UINT32_(value) << UDPHS_EPTCTL_NAK_IN_Pos)) /* Assigment of value for NAK_IN in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_NAK_OUT_Pos              _UINT32_(15)                                         /* (UDPHS_EPTCTL) NAKOUT Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_NAK_OUT_Msk              (_UINT32_(0x1) << UDPHS_EPTCTL_NAK_OUT_Pos)          /* (UDPHS_EPTCTL) NAKOUT Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_NAK_OUT(value)           (UDPHS_EPTCTL_NAK_OUT_Msk & (_UINT32_(value) << UDPHS_EPTCTL_NAK_OUT_Pos)) /* Assigment of value for NAK_OUT in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_BUSY_BANK_Pos            _UINT32_(18)                                         /* (UDPHS_EPTCTL) Busy Bank Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_BUSY_BANK_Msk            (_UINT32_(0x1) << UDPHS_EPTCTL_BUSY_BANK_Pos)        /* (UDPHS_EPTCTL) Busy Bank Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_BUSY_BANK(value)         (UDPHS_EPTCTL_BUSY_BANK_Msk & (_UINT32_(value) << UDPHS_EPTCTL_BUSY_BANK_Pos)) /* Assigment of value for BUSY_BANK in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_SHRT_PCKT_Pos            _UINT32_(31)                                         /* (UDPHS_EPTCTL) Short Packet Interrupt Enabled (cleared upon USB reset) Position */
#define UDPHS_EPTCTL_SHRT_PCKT_Msk            (_UINT32_(0x1) << UDPHS_EPTCTL_SHRT_PCKT_Pos)        /* (UDPHS_EPTCTL) Short Packet Interrupt Enabled (cleared upon USB reset) Mask */
#define UDPHS_EPTCTL_SHRT_PCKT(value)         (UDPHS_EPTCTL_SHRT_PCKT_Msk & (_UINT32_(value) << UDPHS_EPTCTL_SHRT_PCKT_Pos)) /* Assigment of value for SHRT_PCKT in the UDPHS_EPTCTL register */
#define UDPHS_EPTCTL_Msk                      _UINT32_(0x8004FF1B)                                 /* (UDPHS_EPTCTL) Register Mask  */

