Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/udphs.h
/* -------- UDPHS_CTRL : (UDPHS Offset: 0x00) (R/W 32) UDPHS Control Register -------- */
#define UDPHS_CTRL_DEV_ADDR_Pos               _UINT32_(0)                                          /* (UDPHS_CTRL) UDPHS Address (cleared upon USB reset) Position */
#define UDPHS_CTRL_DEV_ADDR_Msk               (_UINT32_(0x7F) << UDPHS_CTRL_DEV_ADDR_Pos)          /* (UDPHS_CTRL) UDPHS Address (cleared upon USB reset) Mask */
#define UDPHS_CTRL_DEV_ADDR(value)            (UDPHS_CTRL_DEV_ADDR_Msk & (_UINT32_(value) << UDPHS_CTRL_DEV_ADDR_Pos)) /* Assigment of value for DEV_ADDR in the UDPHS_CTRL register */
#define UDPHS_CTRL_FADDR_EN_Pos               _UINT32_(7)                                          /* (UDPHS_CTRL) Function Address Enable (cleared upon USB reset) Position */
#define UDPHS_CTRL_FADDR_EN_Msk               (_UINT32_(0x1) << UDPHS_CTRL_FADDR_EN_Pos)           /* (UDPHS_CTRL) Function Address Enable (cleared upon USB reset) Mask */
#define UDPHS_CTRL_FADDR_EN(value)            (UDPHS_CTRL_FADDR_EN_Msk & (_UINT32_(value) << UDPHS_CTRL_FADDR_EN_Pos)) /* Assigment of value for FADDR_EN in the UDPHS_CTRL register */
#define UDPHS_CTRL_EN_UDPHS_Pos               _UINT32_(8)                                          /* (UDPHS_CTRL) UDPHS Enable Position */
#define UDPHS_CTRL_EN_UDPHS_Msk               (_UINT32_(0x1) << UDPHS_CTRL_EN_UDPHS_Pos)           /* (UDPHS_CTRL) UDPHS Enable Mask */
#define UDPHS_CTRL_EN_UDPHS(value)            (UDPHS_CTRL_EN_UDPHS_Msk & (_UINT32_(value) << UDPHS_CTRL_EN_UDPHS_Pos)) /* Assigment of value for EN_UDPHS in the UDPHS_CTRL register */
#define UDPHS_CTRL_DETACH_Pos                 _UINT32_(9)                                          /* (UDPHS_CTRL) Detach Command Position */
#define UDPHS_CTRL_DETACH_Msk                 (_UINT32_(0x1) << UDPHS_CTRL_DETACH_Pos)             /* (UDPHS_CTRL) Detach Command Mask */
#define UDPHS_CTRL_DETACH(value)              (UDPHS_CTRL_DETACH_Msk & (_UINT32_(value) << UDPHS_CTRL_DETACH_Pos)) /* Assigment of value for DETACH in the UDPHS_CTRL register */
#define UDPHS_CTRL_REWAKEUP_Pos               _UINT32_(10)                                         /* (UDPHS_CTRL) Send Remote Wakeup (cleared upon USB reset) Position */
#define UDPHS_CTRL_REWAKEUP_Msk               (_UINT32_(0x1) << UDPHS_CTRL_REWAKEUP_Pos)           /* (UDPHS_CTRL) Send Remote Wakeup (cleared upon USB reset) Mask */
#define UDPHS_CTRL_REWAKEUP(value)            (UDPHS_CTRL_REWAKEUP_Msk & (_UINT32_(value) << UDPHS_CTRL_REWAKEUP_Pos)) /* Assigment of value for REWAKEUP in the UDPHS_CTRL register */
#define UDPHS_CTRL_PULLD_DIS_Pos              _UINT32_(11)                                         /* (UDPHS_CTRL) Pulldown Disable (cleared upon USB reset) Position */
#define UDPHS_CTRL_PULLD_DIS_Msk              (_UINT32_(0x1) << UDPHS_CTRL_PULLD_DIS_Pos)          /* (UDPHS_CTRL) Pulldown Disable (cleared upon USB reset) Mask */
#define UDPHS_CTRL_PULLD_DIS(value)           (UDPHS_CTRL_PULLD_DIS_Msk & (_UINT32_(value) << UDPHS_CTRL_PULLD_DIS_Pos)) /* Assigment of value for PULLD_DIS in the UDPHS_CTRL register */
#define UDPHS_CTRL_Msk                        _UINT32_(0x00000FFF)                                 /* (UDPHS_CTRL) Register Mask  */


/* -------- UDPHS_FNUM : (UDPHS Offset: 0x04) ( R/ 32) UDPHS Frame Number Register -------- */
#define UDPHS_FNUM_MICRO_FRAME_NUM_Pos        _UINT32_(0)                                          /* (UDPHS_FNUM) Microframe Number (cleared upon USB reset) Position */
#define UDPHS_FNUM_MICRO_FRAME_NUM_Msk        (_UINT32_(0x7) << UDPHS_FNUM_MICRO_FRAME_NUM_Pos)    /* (UDPHS_FNUM) Microframe Number (cleared upon USB reset) Mask */
#define UDPHS_FNUM_MICRO_FRAME_NUM(value)     (UDPHS_FNUM_MICRO_FRAME_NUM_Msk & (_UINT32_(value) << UDPHS_FNUM_MICRO_FRAME_NUM_Pos)) /* Assigment of value for MICRO_FRAME_NUM in the UDPHS_FNUM register */
#define UDPHS_FNUM_FRAME_NUMBER_Pos           _UINT32_(3)                                          /* (UDPHS_FNUM) Frame Number as defined in the Packet Field Formats (cleared upon USB reset) Position */
#define UDPHS_FNUM_FRAME_NUMBER_Msk           (_UINT32_(0x7FF) << UDPHS_FNUM_FRAME_NUMBER_Pos)     /* (UDPHS_FNUM) Frame Number as defined in the Packet Field Formats (cleared upon USB reset) Mask */
#define UDPHS_FNUM_FRAME_NUMBER(value)        (UDPHS_FNUM_FRAME_NUMBER_Msk & (_UINT32_(value) << UDPHS_FNUM_FRAME_NUMBER_Pos)) /* Assigment of value for FRAME_NUMBER in the UDPHS_FNUM register */
#define UDPHS_FNUM_FNUM_ERR_Pos               _UINT32_(31)                                         /* (UDPHS_FNUM) Frame Number CRC Error (cleared upon USB reset) Position */
#define UDPHS_FNUM_FNUM_ERR_Msk               (_UINT32_(0x1) << UDPHS_FNUM_FNUM_ERR_Pos)           /* (UDPHS_FNUM) Frame Number CRC Error (cleared upon USB reset) Mask */
#define UDPHS_FNUM_FNUM_ERR(value)            (UDPHS_FNUM_FNUM_ERR_Msk & (_UINT32_(value) << UDPHS_FNUM_FNUM_ERR_Pos)) /* Assigment of value for FNUM_ERR in the UDPHS_FNUM register */
#define UDPHS_FNUM_Msk                        _UINT32_(0x80003FFF)                                 /* (UDPHS_FNUM) Register Mask  */


/* -------- UDPHS_IEN : (UDPHS Offset: 0x10) (R/W 32) UDPHS Interrupt Enable Register -------- */
#define UDPHS_IEN_DET_SUSPD_Pos               _UINT32_(1)                                          /* (UDPHS_IEN) Suspend Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DET_SUSPD_Msk               (_UINT32_(0x1) << UDPHS_IEN_DET_SUSPD_Pos)           /* (UDPHS_IEN) Suspend Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DET_SUSPD(value)            (UDPHS_IEN_DET_SUSPD_Msk & (_UINT32_(value) << UDPHS_IEN_DET_SUSPD_Pos)) /* Assigment of value for DET_SUSPD in the UDPHS_IEN register */
#define UDPHS_IEN_MICRO_SOF_Pos               _UINT32_(2)                                          /* (UDPHS_IEN) Micro-SOF Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_MICRO_SOF_Msk               (_UINT32_(0x1) << UDPHS_IEN_MICRO_SOF_Pos)           /* (UDPHS_IEN) Micro-SOF Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_MICRO_SOF(value)            (UDPHS_IEN_MICRO_SOF_Msk & (_UINT32_(value) << UDPHS_IEN_MICRO_SOF_Pos)) /* Assigment of value for MICRO_SOF in the UDPHS_IEN register */
#define UDPHS_IEN_INT_SOF_Pos                 _UINT32_(3)                                          /* (UDPHS_IEN) SOF Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_INT_SOF_Msk                 (_UINT32_(0x1) << UDPHS_IEN_INT_SOF_Pos)             /* (UDPHS_IEN) SOF Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_INT_SOF(value)              (UDPHS_IEN_INT_SOF_Msk & (_UINT32_(value) << UDPHS_IEN_INT_SOF_Pos)) /* Assigment of value for INT_SOF in the UDPHS_IEN register */
#define UDPHS_IEN_ENDRESET_Pos                _UINT32_(4)                                          /* (UDPHS_IEN) End Of Reset Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_ENDRESET_Msk                (_UINT32_(0x1) << UDPHS_IEN_ENDRESET_Pos)            /* (UDPHS_IEN) End Of Reset Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_ENDRESET(value)             (UDPHS_IEN_ENDRESET_Msk & (_UINT32_(value) << UDPHS_IEN_ENDRESET_Pos)) /* Assigment of value for ENDRESET in the UDPHS_IEN register */
#define UDPHS_IEN_WAKE_UP_Pos                 _UINT32_(5)                                          /* (UDPHS_IEN) Wake Up CPU Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_WAKE_UP_Msk                 (_UINT32_(0x1) << UDPHS_IEN_WAKE_UP_Pos)             /* (UDPHS_IEN) Wake Up CPU Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_WAKE_UP(value)              (UDPHS_IEN_WAKE_UP_Msk & (_UINT32_(value) << UDPHS_IEN_WAKE_UP_Pos)) /* Assigment of value for WAKE_UP in the UDPHS_IEN register */
#define UDPHS_IEN_ENDOFRSM_Pos                _UINT32_(6)                                          /* (UDPHS_IEN) End Of Resume Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_ENDOFRSM_Msk                (_UINT32_(0x1) << UDPHS_IEN_ENDOFRSM_Pos)            /* (UDPHS_IEN) End Of Resume Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_ENDOFRSM(value)             (UDPHS_IEN_ENDOFRSM_Msk & (_UINT32_(value) << UDPHS_IEN_ENDOFRSM_Pos)) /* Assigment of value for ENDOFRSM in the UDPHS_IEN register */
#define UDPHS_IEN_UPSTR_RES_Pos               _UINT32_(7)                                          /* (UDPHS_IEN) Upstream Resume Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_UPSTR_RES_Msk               (_UINT32_(0x1) << UDPHS_IEN_UPSTR_RES_Pos)           /* (UDPHS_IEN) Upstream Resume Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_UPSTR_RES(value)            (UDPHS_IEN_UPSTR_RES_Msk & (_UINT32_(value) << UDPHS_IEN_UPSTR_RES_Pos)) /* Assigment of value for UPSTR_RES in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_0_Pos                   _UINT32_(8)                                          /* (UDPHS_IEN) Endpoint 0 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_0_Msk                   (_UINT32_(0x1) << UDPHS_IEN_EPT_0_Pos)               /* (UDPHS_IEN) Endpoint 0 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_0(value)                (UDPHS_IEN_EPT_0_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_0_Pos)) /* Assigment of value for EPT_0 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_1_Pos                   _UINT32_(9)                                          /* (UDPHS_IEN) Endpoint 1 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_1_Msk                   (_UINT32_(0x1) << UDPHS_IEN_EPT_1_Pos)               /* (UDPHS_IEN) Endpoint 1 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_1(value)                (UDPHS_IEN_EPT_1_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_1_Pos)) /* Assigment of value for EPT_1 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_2_Pos                   _UINT32_(10)                                         /* (UDPHS_IEN) Endpoint 2 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_2_Msk                   (_UINT32_(0x1) << UDPHS_IEN_EPT_2_Pos)               /* (UDPHS_IEN) Endpoint 2 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_2(value)                (UDPHS_IEN_EPT_2_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_2_Pos)) /* Assigment of value for EPT_2 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_3_Pos                   _UINT32_(11)                                         /* (UDPHS_IEN) Endpoint 3 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_3_Msk                   (_UINT32_(0x1) << UDPHS_IEN_EPT_3_Pos)               /* (UDPHS_IEN) Endpoint 3 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_3(value)                (UDPHS_IEN_EPT_3_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_3_Pos)) /* Assigment of value for EPT_3 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_4_Pos                   _UINT32_(12)                                         /* (UDPHS_IEN) Endpoint 4 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_4_Msk                   (_UINT32_(0x1) << UDPHS_IEN_EPT_4_Pos)               /* (UDPHS_IEN) Endpoint 4 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_4(value)                (UDPHS_IEN_EPT_4_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_4_Pos)) /* Assigment of value for EPT_4 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_5_Pos                   _UINT32_(13)                                         /* (UDPHS_IEN) Endpoint 5 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_5_Msk                   (_UINT32_(0x1) << UDPHS_IEN_EPT_5_Pos)               /* (UDPHS_IEN) Endpoint 5 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_5(value)                (UDPHS_IEN_EPT_5_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_5_Pos)) /* Assigment of value for EPT_5 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_6_Pos                   _UINT32_(14)                                         /* (UDPHS_IEN) Endpoint 6 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_6_Msk                   (_UINT32_(0x1) << UDPHS_IEN_EPT_6_Pos)               /* (UDPHS_IEN) Endpoint 6 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_6(value)                (UDPHS_IEN_EPT_6_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_6_Pos)) /* Assigment of value for EPT_6 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_7_Pos                   _UINT32_(15)                                         /* (UDPHS_IEN) Endpoint 7 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_7_Msk                   (_UINT32_(0x1) << UDPHS_IEN_EPT_7_Pos)               /* (UDPHS_IEN) Endpoint 7 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_7(value)                (UDPHS_IEN_EPT_7_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_7_Pos)) /* Assigment of value for EPT_7 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_8_Pos                   _UINT32_(16)                                         /* (UDPHS_IEN) Endpoint 8 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_8_Msk                   (_UINT32_(0x1) << UDPHS_IEN_EPT_8_Pos)               /* (UDPHS_IEN) Endpoint 8 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_8(value)                (UDPHS_IEN_EPT_8_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_8_Pos)) /* Assigment of value for EPT_8 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_9_Pos                   _UINT32_(17)                                         /* (UDPHS_IEN) Endpoint 9 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_9_Msk                   (_UINT32_(0x1) << UDPHS_IEN_EPT_9_Pos)               /* (UDPHS_IEN) Endpoint 9 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_9(value)                (UDPHS_IEN_EPT_9_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_9_Pos)) /* Assigment of value for EPT_9 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_10_Pos                  _UINT32_(18)                                         /* (UDPHS_IEN) Endpoint 10 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_10_Msk                  (_UINT32_(0x1) << UDPHS_IEN_EPT_10_Pos)              /* (UDPHS_IEN) Endpoint 10 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_10(value)               (UDPHS_IEN_EPT_10_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_10_Pos)) /* Assigment of value for EPT_10 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_11_Pos                  _UINT32_(19)                                         /* (UDPHS_IEN) Endpoint 11 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_11_Msk                  (_UINT32_(0x1) << UDPHS_IEN_EPT_11_Pos)              /* (UDPHS_IEN) Endpoint 11 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_11(value)               (UDPHS_IEN_EPT_11_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_11_Pos)) /* Assigment of value for EPT_11 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_12_Pos                  _UINT32_(20)                                         /* (UDPHS_IEN) Endpoint 12 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_12_Msk                  (_UINT32_(0x1) << UDPHS_IEN_EPT_12_Pos)              /* (UDPHS_IEN) Endpoint 12 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_12(value)               (UDPHS_IEN_EPT_12_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_12_Pos)) /* Assigment of value for EPT_12 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_13_Pos                  _UINT32_(21)                                         /* (UDPHS_IEN) Endpoint 13 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_13_Msk                  (_UINT32_(0x1) << UDPHS_IEN_EPT_13_Pos)              /* (UDPHS_IEN) Endpoint 13 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_13(value)               (UDPHS_IEN_EPT_13_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_13_Pos)) /* Assigment of value for EPT_13 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_14_Pos                  _UINT32_(22)                                         /* (UDPHS_IEN) Endpoint 14 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_14_Msk                  (_UINT32_(0x1) << UDPHS_IEN_EPT_14_Pos)              /* (UDPHS_IEN) Endpoint 14 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_14(value)               (UDPHS_IEN_EPT_14_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_14_Pos)) /* Assigment of value for EPT_14 in the UDPHS_IEN register */
#define UDPHS_IEN_EPT_15_Pos                  _UINT32_(23)                                         /* (UDPHS_IEN) Endpoint 15 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_EPT_15_Msk                  (_UINT32_(0x1) << UDPHS_IEN_EPT_15_Pos)              /* (UDPHS_IEN) Endpoint 15 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_EPT_15(value)               (UDPHS_IEN_EPT_15_Msk & (_UINT32_(value) << UDPHS_IEN_EPT_15_Pos)) /* Assigment of value for EPT_15 in the UDPHS_IEN register */
#define UDPHS_IEN_DMA_1_Pos                   _UINT32_(25)                                         /* (UDPHS_IEN) DMA Channel 1 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_1_Msk                   (_UINT32_(0x1) << UDPHS_IEN_DMA_1_Pos)               /* (UDPHS_IEN) DMA Channel 1 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_1(value)                (UDPHS_IEN_DMA_1_Msk & (_UINT32_(value) << UDPHS_IEN_DMA_1_Pos)) /* Assigment of value for DMA_1 in the UDPHS_IEN register */
#define UDPHS_IEN_DMA_2_Pos                   _UINT32_(26)                                         /* (UDPHS_IEN) DMA Channel 2 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_2_Msk                   (_UINT32_(0x1) << UDPHS_IEN_DMA_2_Pos)               /* (UDPHS_IEN) DMA Channel 2 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_2(value)                (UDPHS_IEN_DMA_2_Msk & (_UINT32_(value) << UDPHS_IEN_DMA_2_Pos)) /* Assigment of value for DMA_2 in the UDPHS_IEN register */
#define UDPHS_IEN_DMA_3_Pos                   _UINT32_(27)                                         /* (UDPHS_IEN) DMA Channel 3 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_3_Msk                   (_UINT32_(0x1) << UDPHS_IEN_DMA_3_Pos)               /* (UDPHS_IEN) DMA Channel 3 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_3(value)                (UDPHS_IEN_DMA_3_Msk & (_UINT32_(value) << UDPHS_IEN_DMA_3_Pos)) /* Assigment of value for DMA_3 in the UDPHS_IEN register */
#define UDPHS_IEN_DMA_4_Pos                   _UINT32_(28)                                         /* (UDPHS_IEN) DMA Channel 4 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_4_Msk                   (_UINT32_(0x1) << UDPHS_IEN_DMA_4_Pos)               /* (UDPHS_IEN) DMA Channel 4 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_4(value)                (UDPHS_IEN_DMA_4_Msk & (_UINT32_(value) << UDPHS_IEN_DMA_4_Pos)) /* Assigment of value for DMA_4 in the UDPHS_IEN register */
#define UDPHS_IEN_DMA_5_Pos                   _UINT32_(29)                                         /* (UDPHS_IEN) DMA Channel 5 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_5_Msk                   (_UINT32_(0x1) << UDPHS_IEN_DMA_5_Pos)               /* (UDPHS_IEN) DMA Channel 5 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_5(value)                (UDPHS_IEN_DMA_5_Msk & (_UINT32_(value) << UDPHS_IEN_DMA_5_Pos)) /* Assigment of value for DMA_5 in the UDPHS_IEN register */
#define UDPHS_IEN_DMA_6_Pos                   _UINT32_(30)                                         /* (UDPHS_IEN) DMA Channel 6 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_6_Msk                   (_UINT32_(0x1) << UDPHS_IEN_DMA_6_Pos)               /* (UDPHS_IEN) DMA Channel 6 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_6(value)                (UDPHS_IEN_DMA_6_Msk & (_UINT32_(value) << UDPHS_IEN_DMA_6_Pos)) /* Assigment of value for DMA_6 in the UDPHS_IEN register */
#define UDPHS_IEN_DMA_7_Pos                   _UINT32_(31)                                         /* (UDPHS_IEN) DMA Channel 7 Interrupt Enable (cleared upon USB reset) Position */
#define UDPHS_IEN_DMA_7_Msk                   (_UINT32_(0x1) << UDPHS_IEN_DMA_7_Pos)               /* (UDPHS_IEN) DMA Channel 7 Interrupt Enable (cleared upon USB reset) Mask */
#define UDPHS_IEN_DMA_7(value)                (UDPHS_IEN_DMA_7_Msk & (_UINT32_(value) << UDPHS_IEN_DMA_7_Pos)) /* Assigment of value for DMA_7 in the UDPHS_IEN register */
#define UDPHS_IEN_Msk                         _UINT32_(0xFEFFFFFE)                                 /* (UDPHS_IEN) Register Mask  */

